InformationRegisters/СоответствиеНоменклатурыСырьяГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСырьяГИСМТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСырьяГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПроверкиИПодбораИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПроверкиИПодбораИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПроверкиИПодбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиИПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТребуемоеДействиеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТребуемоеДействиеДокументЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Ключ таблицы штрихкодов упаковок (если их несколько)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыСырьяГИСМТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСопоставленноеСырьеВДокументе(ВходящиеДанные, ЗаполнятьСырье = Истина, ДокументОснование = Неопределено) Экспорт
	
	// Приоритеты:
	//1. По полному соответствию (номенклатура, характеристика, серия)
	//2. По неполному соответствию (номенклатура, характеристика)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ИндексСтроки",   ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаДанных.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаДанных.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ТаблицаДанных.Колонки.Добавить("Серия",          Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	
	ТипВходящихДанных = ТипЗнч(ВходящиеДанные);
	Если ТипВходящихДанных = Тип("ДанныеФормыКоллекция")
		Или ТипВходящихДанных = Тип("ТаблицаЗначений")
		Или ТипВходящихДанных = Тип("Массив") Тогда
		
		Если ВходящиеДанные.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнятьСопоставление = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВходящиеДанные[0], "НоменклатураДляВыбора");
		
		ИндексСтроки = 0;
		Для Каждого СтрокаДанных Из ВходящиеДанные Цикл
			Если Не ЗначениеЗаполнено(СтрокаДанных.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТаблицы = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДанных);
			СтрокаТаблицы.ИндексСтроки = ИндексСтроки;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
		
	ИначеЕсли ТипВходящихДанных = Тип("ДанныеФормыЭлементКоллекции")
		Или ТипВходящихДанных = Тип("СтрокаТаблицыЗначений")
		Или ТипВходящихДанных = Тип("Структура") Тогда
		
		ЗаполнятьСопоставление = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВходящиеДанные, "НоменклатураДляВыбора");
		
		Если Не ЗначениеЗаполнено(ВходящиеДанные.Номенклатура) Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВходящиеДанные);
		СтрокаТаблицы.ИндексСтроки = -1;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Не ЗаполнятьСырье И Не ЗаполнятьСопоставление
		Или ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений();
	Запрос         = Новый Запрос;
	Запрос.УстановитьПараметр("Товары",                 ТаблицаДанных);
	Запрос.УстановитьПараметр("ЗаполнятьСопоставление", ЗаполнятьСырье И ЗначениеЗаполнено(ДокументОснование));
	Запрос.УстановитьПараметр("ДокументОснование",      ДокументОснование);
	
	СписокЗапросов.Добавить("
		|ВЫБРАТЬ
		|	Товары.ИндексСтроки   КАК ИндексСтроки,
		|	Товары.Номенклатура   КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия          КАК Серия
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары");
	
	СписокЗапросов.Добавить("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(СоответствиеНоменклатурыСырьяГИСМТ.Сырье, НЕОПРЕДЕЛЕНО) КАК Сырье,
		|	Товары.ИндексСтроки КАК ИндексСтроки
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыСырьяГИСМТ КАК СоответствиеНоменклатурыСырьяГИСМТ
		|			ПО СоответствиеНоменклатурыСырьяГИСМТ.Номенклатура = Товары.Номенклатура
		|			И СоответствиеНоменклатурыСырьяГИСМТ.Характеристика = Товары.Характеристика
		|ИТОГИ ПО
		|	ИндексСтроки",
		"СтрокиСырья");
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	СтатусыПроверкиИПодбораИС.ДанныеПроверкиИПодбора КАК ДанныеПроверкиИПодбора
		|
		|ИЗ
		|	РегистрСведений.СтатусыПроверкиИПодбораИС КАК СтатусыПроверкиИПодбораИС
		|ГДЕ
		|	СтатусыПроверкиИПодбораИС.Документ = &ДокументОснование
		|	И СтатусыПроверкиИПодбораИС.Сценарий = 0
		|	И &ДокументОснование <> НЕОПРЕДЕЛЕНО
		|	И &ЗаполнятьСопоставление",
		"УточнениеКодаИдентификации");
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	//@skip-check bsl-legacy-check-string-literal
	ВыборкаПоСтроке = РезультатыЗапроса["СтрокиСырья"].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//@skip-check bsl-legacy-check-string-literal
	ВыборкаУточнение = РезультатыЗапроса["УточнениеКодаИдентификации"].Выбрать();
	
	Если ВыборкаУточнение.Следующий() Тогда
		ДанныеПроверкиИПодбора = ВыборкаУточнение.ДанныеПроверкиИПодбора.Получить();
		Если ДанныеПроверкиИПодбора <> Неопределено
			И ДанныеПроверкиИПодбора.Свойство("СопоставленноеСырье") Тогда
			СопоставленноеСырье = ДанныеПроверкиИПодбора.СопоставленноеСырье;
			ХарактеристикиИспользуются = ОбщегоНазначенияИС.ХарактеристикиИспользуются();
			Если ХарактеристикиИспользуются Тогда
				Поля = "Номенклатура,Характеристика";
			Иначе
				Поля = "Номенклатура";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Пока ВыборкаПоСтроке.Следующий() Цикл
		
		Если ВыборкаПоСтроке.ИндексСтроки = -1 Тогда
			Данные = ВходящиеДанные;
		Иначе
			Данные = ВходящиеДанные.Получить(ВыборкаПоСтроке.ИндексСтроки);
		КонецЕсли;
		
		МассивСырья = Новый Массив;
		
		ВыборкаСырье = ВыборкаПоСтроке.Выбрать();
		Пока ВыборкаСырье.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаСырье.Сырье) Тогда
				Продолжить;
			КонецЕсли;
			МассивСырья.Добавить(ВыборкаСырье.Сырье);
		КонецЦикла;
		
		КоличествоСопоставлено = МассивСырья.Количество();
		
		Если ЗаполнятьСырье Тогда
			Если КоличествоСопоставлено = 1 Тогда
				Данные.Сырье = МассивСырья[0];
			ИначеЕсли КоличествоСопоставлено > 1 И СопоставленноеСырье <> Неопределено Тогда
				СтруктураПоиска = Новый Структура(Поля);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Данные);
				НайденныеСтроки = СопоставленноеСырье.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() Тогда
					Данные.Сырье = НайденныеСтроки[0].Сырье;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаполнятьСопоставление Тогда
			Если КоличествоСопоставлено = 0 Тогда
				Данные.СопоставлениеТекст = НСтр("ru = '<Не сопоставлено>'");
			ИначеЕсли КоличествоСопоставлено = 1 Тогда
				Данные.СопоставлениеТекст = "";
			Иначе
				Данные.СопоставлениеТекст = СтрШаблон(НСтр("ru = '<Несколько позиций (%1)>'"), КоличествоСопоставлено);
			КонецЕсли;
			Данные.НоменклатураДляВыбора.ЗагрузитьЗначения(МассивСырья);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Таблица идентификаторов сырья.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица идентификаторов сырья:
// * Номенклатура - ОпределяемыйТип.Номенклатура
// * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры
// * ПодходитИдентификационныйКод - Булево
// * ИдентификационныйКод - ОпределяемыйТип.GTIN
Функция ТаблицаИдентификаторовСырья() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура",                 Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Таблица.Колонки.Добавить("Характеристика",               Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	Таблица.Колонки.Добавить("ПодходитИдентификационныйКод", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Таблица.Колонки.Добавить("ИдентификационныйКод",         Метаданные.ОпределяемыеТипы.GTIN.Тип);
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗаполнитьИдентификационныеКоды(ТаблицаСырье, ПараметрыСканирования = Неопределено) Экспорт
	
	ХарактеристикиИспользуются = ОбщегоНазначенияИС.ХарактеристикиИспользуются();
	Запрос                     = Новый Запрос;
	СписокЗапросов             = Новый СписокЗначений();
	
	Если ХарактеристикиИспользуются Тогда
		Поля = "Номенклатура,Характеристика";
		СписокЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ТаблицаСырье.Номенклатура КАК Номенклатура,
			|	ТаблицаСырье.Характеристика КАК Характеристика
			|ПОМЕСТИТЬ Источник
			|ИЗ
			|	&ТаблицаСырье КАК ТаблицаСырье
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Источник.Номенклатура КАК Номенклатура,
			|	Источник.Характеристика КАК Характеристика,
			|	ЕСТЬNULL(СоответствиеНоменклатурыСырьяГИСМТ.Сырье.Идентификатор, """") КАК ИдентификационныйКод
			|ИЗ
			|	Источник КАК Источник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыСырьяГИСМТ КАК СоответствиеНоменклатурыСырьяГИСМТ
			|		ПО Источник.Номенклатура = СоответствиеНоменклатурыСырьяГИСМТ.Номенклатура
			|		И Источник.Характеристика = СоответствиеНоменклатурыСырьяГИСМТ.Характеристика",
			"ИдентификационныеКоды");
	Иначе
		Поля = "Номенклатура";
		СписокЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ТаблицаСырье.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ Источник
			|ИЗ
			|	&ТаблицаСырье КАК ТаблицаСырье
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Источник.Номенклатура КАК Номенклатура,
			|	ЕСТЬNULL(СоответствиеНоменклатурыСырьяГИСМТ.Сырье.Идентификатор, """") КАК ИдентификационныйКод
			|ИЗ
			|	Источник КАК Источник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыСырьяГИСМТ КАК СоответствиеНоменклатурыСырьяГИСМТ
			|		ПО Источник.Номенклатура = СоответствиеНоменклатурыСырьяГИСМТ.Номенклатура",
			"ИдентификационныеКоды");
	КонецЕсли;
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	СтатусыПроверкиИПодбораИС.ДанныеПроверкиИПодбора КАК ДанныеПроверкиИПодбора
		|
		|ИЗ
		|	РегистрСведений.СтатусыПроверкиИПодбораИС КАК СтатусыПроверкиИПодбораИС
		|ГДЕ
		|	СтатусыПроверкиИПодбораИС.Документ = &Документ
		|	И СтатусыПроверкиИПодбораИС.Сценарий = 0
		|	И &Документ <> НЕОПРЕДЕЛЕНО",
		"УточнениеКодаИдентификации");
	
	Запрос.УстановитьПараметр("ТаблицаСырье", ТаблицаСырье);
	
	Если ПараметрыСканирования <> Неопределено
		И ЗначениеЗаполнено(ПараметрыСканирования.СсылкаНаОбъект) Тогда
		Запрос.УстановитьПараметр("Документ", ПараметрыСканирования.СсылкаНаОбъект);
	Иначе
		Запрос.УстановитьПараметр("Документ", Неопределено);
	КонецЕсли;
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	//@skip-check bsl-legacy-check-string-literal
	ВыборкаКоды = РезультатыЗапроса["ИдентификационныеКоды"].Выбрать();
	//@skip-check bsl-legacy-check-string-literal
	ВыборкаУточнение = РезультатыЗапроса["УточнениеКодаИдентификации"].Выбрать();
	
	Если ВыборкаУточнение.Следующий() Тогда
		ДанныеПроверкиИПодбора = ВыборкаУточнение.ДанныеПроверкиИПодбора.Получить();
	КонецЕсли;
	
	Поиск = Новый Структура(Поля);
	Пока ВыборкаКоды.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Поиск, ВыборкаКоды);
		ИсходнаяСтрока = ТаблицаСырье.НайтиСтроки(Поиск)[0];
		
		Если ДанныеПроверкиИПодбора <> Неопределено
			И ДанныеПроверкиИПодбора.Свойство("СопоставленноеСырье") Тогда
			СтрокиУточнения = ДанныеПроверкиИПодбора.СопоставленноеСырье.НайтиСтроки(Поиск);
			Если СтрокиУточнения.Количество()
				И ЗначениеЗаполнено(СтрокиУточнения[0].Сырье) Тогда
				ИсходнаяСтрока.ПодходитИдентификационныйКод = 1;
				ИсходнаяСтрока.ИдентификационныйКод = СтрокиУточнения[0].Идентификатор;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИсходнаяСтрока.ПодходитИдентификационныйКод = ИсходнаяСтрока.ПодходитИдентификационныйКод + 1;
		ИсходнаяСтрока.ИдентификационныйКод = ВыборкаКоды.ИдентификационныйКод;
		
	КонецЦикла;
	
КонецПроцедуры

// Сопоставляет фармацевтическое сырье с номенклатурой.
//
// Параметры:
//  Объект - ДокументОбъект - Объект в котором сопоставляется номенклатура.
//  ОписаниеТабличнойЧасти - Строка, ТаблицаЗначений - имя табличной части или таблица значений для сопоставления.
Процедура ЗаписатьСоответствие(Объект, ОписаниеТабличнойЧасти = "Товары") Экспорт
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Данные.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	Данные.Колонки.Добавить("Сырье",          Новый ОписаниеТипов("СправочникСсылка.КлассификаторСырьяГИСМТ"));
	
	Если ОписаниеТабличнойЧасти = "Шапка" Тогда
		ЗаполнитьЗначенияСвойств(Данные.Добавить(), Объект);
	ИначеЕсли ТипЗнч(ОписаниеТабличнойЧасти) = Тип("Строка") Тогда
		Для Каждого СтрокаТаблицы Из Объект[ОписаниеТабличнойЧасти] Цикл
			НоваяСтрока = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
	Иначе
		Данные = ОписаниеТабличнойЧасти;
	КонецЕсли;
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Номенклатура   КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Сырье          КАК Сырье
	|ПОМЕСТИТЬ ИсходныеДанныеПредварительно
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура   КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Сырье          КАК Сырье
	|ПОМЕСТИТЬ ТаблицаПредварительно
	|ИЗ
	|	ИсходныеДанныеПредварительно КАК Т
	|ГДЕ
	|	Т.Сырье <> &ПустоеСырье
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Сырье
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура   КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Сырье          КАК Сырье
	|ИЗ
	|	ТаблицаПредварительно КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыСырьяГИСМТ КАК УжеСопоставлено
	|		ПО УжеСопоставлено.Номенклатура   = Т.Номенклатура
	|		И  УжеСопоставлено.Характеристика = Т.Характеристика
	|		И  УжеСопоставлено.Сырье          = Т.Сырье
	|ГДЕ
	|	Т.Номенклатура НЕ В (&НезаполненныеЗначенияНоменклатура)
	|	И УжеСопоставлено.Номенклатура ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Сырье");
	
	Запрос.УстановитьПараметр("Таблица", Данные);
	Запрос.УстановитьПараметр("НезаполненныеЗначенияНоменклатура", ИнтеграцияИС.НезаполненныеЗначенияОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Номенклатура));
	Запрос.УстановитьПараметр("ПустоеСырье",                       Справочники.КлассификаторСырьяГИСМТ.ПустаяСсылка());
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура, Истина);
		НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика, Истина);
		НаборЗаписей.Отбор.Сырье.Установить(Выборка.Сырье, Истина);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Номенклатура   = Выборка.Номенклатура;
		НоваяЗапись.Характеристика = Выборка.Характеристика;
		НоваяЗапись.Сырье          = Выборка.Сырье;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			
			ТекстОшибки = НСтр("ru = 'При записи соответствия номенклатуры фармацевтического сырья произошла ошибка:'")
			+ Символы.ПС + "%1";
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстОшибки, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			
			ОбщегоНазначенияИСМП.ЗаписатьОшибкуВЖурналРегистрации(
				СтрШаблон(ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
